<template>
    <footer class="bg-gray-50">
        <v-container>
            <div class="grid grid-cols-3 gap-x-44">
                <v-col class="flex flex-col gap-y-3">
                    <svg width="25" height="45" viewBox="0 0 25 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M0.465843 10.3828H0V18.7188H9.16149C10.0155 18.7188 10.3261 20.0078 9.54969 20.4375L7.76398 21.3828C5.35715 22.6719 2.95032 23.3594 0.465843 23.3594H0V31.6953H8.92858C9.78261 31.6953 10.0932 32.9844 9.31678 33.4141L7.45342 34.3594C5.20187 35.5625 2.79504 36.1641 0.465843 36.1641H0V44.5H8.92858L9.93788 43.125C14.2857 37.5391 19.3323 34.6172 24.6118 34.6172H25V26.2812H16.0714C15.2174 26.2812 14.9068 24.9922 15.6832 24.5625L17.5466 23.6172C19.7982 22.4141 22.205 21.8125 24.5342 21.8125H24.9224V13.4766H15.8385C14.9845 13.4766 14.6739 12.1875 15.4503 11.7578L17.236 10.8125C19.6429 9.52343 22.0497 8.83595 24.5342 8.83595H24.9224V0.5H15.9938L14.9845 1.875C10.7919 7.46094 5.66771 10.3828 0.465843 10.3828Z"
                            fill="#505050" />
                    </svg>
                    <p class="text-xs font-light">នាគហារឹមរបស់ពួកយើងមានបំណងក្នុងការផ្តល់នូវគ្រឿងសង្ហារឹមដែលស្រស់ស្អាត
                        និងគ្រឿងសង្ហារឹមដែលមានមុខងារដែលសាកសមនឹងតម្រូវការរបស់អតិថិជន។
                        ពួកយើងធ្វើការផ្តល់ជូននូវសម្ភារះដែលមានគុណភាពខ្ពស់ជាមួយនឹងវត្ថុធាតុដើមល្អៗដោយធានាបាននូវតម្លៃដែលសមរម្យ
                        និង អាចទុកចិត្តបាន</p>
                </v-col>
                <v-col class="flex flex-col gap-y-8 justify-center">
                    <h6 class="font-bold">គ្រឿងសង្ហារឹមរបស់យើង</h6>
                    <ul class="list-none text-sm font-semibold grid grid-cols-2 gap-y-3 gap-x-4">
                        <li>
                            <a href="#">បន្ទប់ទទួលភ្ញៀវ</a>
                        </li>
                        <li>
                            <a href="#">បន្ទប់គេង</a>
                        </li>
                        <li>
                            <a href="#">បន្ទប់ទទួលទានអាហារ</a>
                        </li>
                        <li>
                            <a href="#">បន្ទប់ការិយាល័យ</a>
                        </li>
                        <li>
                            <a href="#">បន្ទប់ការិយាល័យ</a>
                        </li>
                        <li>
                            <a href="#">បន្ទប់ការិយាល័យ</a>
                        </li>
                        <li>
                            <a href="#">បន្ទប់ការិយាល័យ</a>
                        </li>
                        <li>
                            <a href="#">បន្ទប់ការិយាល័យ</a>
                        </li>

                    </ul>
                </v-col>
                <v-col class="flex flex-col gap-y-8">
                    <h6 class="font-bold">ទាក់ទងមកពួកយើង</h6>
                    <ul class="flex flex-col gap-y-4">
                        <the-social-contact text="Facebook">
                            <svg width="20" height="20" viewBox="0 0 10 20" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M8.14996 3.29509H9.96164V0.139742C9.64908 0.0967442 8.57414 0 7.32226 0C4.71016 0 2.92081 1.643 2.92081 4.66274V7.44186H0.0383301V10.9693H2.92081V19.845H6.45487V10.9701H9.22076L9.65983 7.44269H6.45404V5.01251C6.45487 3.99297 6.72939 3.29509 8.14996 3.29509Z"
                                    fill="#1E2833" />
                            </svg>
                        </the-social-contact>
                        <the-social-contact text="Twitter">
                            <svg width="20" height="16" viewBox="0 0 20 16" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M19.5556 1.881C18.8283 2.2 18.0534 2.41144 17.2456 2.51411C18.0767 2.01789 18.711 1.23811 19.0092 0.298222C18.2343 0.760222 17.3788 1.08656 16.467 1.26867C15.7312 0.485222 14.6826 0 13.5386 0C11.319 0 9.53211 1.80156 9.53211 4.01011C9.53211 4.32789 9.559 4.63344 9.625 4.92433C6.292 4.76178 3.34278 3.16433 1.36156 0.730889C1.01567 1.331 0.812778 2.01789 0.812778 2.75733C0.812778 4.14578 1.52778 5.37656 2.59356 6.08911C1.94944 6.07689 1.31756 5.88989 0.782222 5.59533C0.782222 5.60756 0.782222 5.62344 0.782222 5.63933C0.782222 7.58756 2.17189 9.20578 3.99422 9.57856C3.66789 9.66778 3.31222 9.71056 2.94311 9.71056C2.68644 9.71056 2.42733 9.69589 2.18411 9.64211C2.70356 11.2298 4.17756 12.397 5.93022 12.4349C4.56622 13.5019 2.83433 14.1448 0.959444 14.1448C0.630667 14.1448 0.315333 14.1301 0 14.0898C1.77589 15.235 3.88056 15.8889 6.15022 15.8889C13.5276 15.8889 17.5609 9.77778 17.5609 4.48067C17.5609 4.30344 17.5548 4.13233 17.5462 3.96244C18.3419 3.39778 19.0104 2.69256 19.5556 1.881Z"
                                    fill="#1E2833" />
                            </svg>
                        </the-social-contact>
                        <the-social-contact text="Instagram">
                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none"
                                xmlns="http://www.w3.org/2000/svg">
                                <path fill-rule="evenodd" clip-rule="evenodd"
                                    d="M6.25 0H13.75C17.2013 0 20 2.79875 20 6.25V13.75C20 17.2013 17.2013 20 13.75 20H6.25C2.79875 20 0 17.2013 0 13.75V6.25C0 2.79875 2.79875 0 6.25 0ZM13.75 18.125C16.1625 18.125 18.125 16.1625 18.125 13.75V6.25C18.125 3.8375 16.1625 1.875 13.75 1.875H6.25C3.8375 1.875 1.875 3.8375 1.875 6.25V13.75C1.875 16.1625 3.8375 18.125 6.25 18.125H13.75Z"
                                    fill="#1E2833" />
                                <path fill-rule="evenodd" clip-rule="evenodd"
                                    d="M5 10C5 7.23875 7.23875 5 10 5C12.7613 5 15 7.23875 15 10C15 12.7613 12.7613 15 10 15C7.23875 15 5 12.7613 5 10ZM6.875 10C6.875 11.7225 8.2775 13.125 10 13.125C11.7225 13.125 13.125 11.7225 13.125 10C13.125 8.27625 11.7225 6.875 10 6.875C8.2775 6.875 6.875 8.27625 6.875 10Z"
                                    fill="#1E2833" />
                                <circle cx="15.375" cy="4.62499" r="0.66625" fill="#1E2833" />
                            </svg>
                        </the-social-contact>
                    </ul>
                </v-col>
            </div>
        </v-container>
        <v-container>
            <div class="flex justify-between items-center py-4">
                <p class="text-xs font-light">© {{ new Date().getFullYear() }} រក្សាសិទ្ធិគ្រប់យ៉ាងដោយនាគហារឹម</p>
                <div class="flex justify-center gap-x-24">
                    <p class="text-xs font-light">លក្ខខណ្ឌប្រើប្រាស់</p>
                    <p class="text-xs font-light">លក្ខខណ្ឌប្រើប្រាស់</p>
                </div>
            </div>
        </v-container>
    </footer>
</template>

<script setup>
import TheSocialContact from '@/components/cards/TheSocialContact.vue';

</script>

<style scoped></style>